===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
DecoderOnlyTransformer                        [256, 70, 5000]           --
├─Embedding: 1-1                              [256, 70, 256]            1,280,000
├─PositionalEncoding: 1-2                     [256, 70, 256]            --
├─Dropout: 1-3                                [256, 70, 256]            --
├─ModuleList: 1-4                             --                        --
│    └─SelfAttentionDecoderLayer: 2-1         [256, 70, 256]            --
│    │    └─SelfAttentionLayer: 3-1           [256, 70, 256]            263,680
│    │    └─FeedForwardLayer: 3-2             [256, 70, 256]            526,080
│    └─SelfAttentionDecoderLayer: 2-2         [256, 70, 256]            --
│    │    └─SelfAttentionLayer: 3-3           [256, 70, 256]            263,680
│    │    └─FeedForwardLayer: 3-4             [256, 70, 256]            526,080
├─LayerNorm: 1-5                              [256, 70, 256]            512
├─Linear: 1-6                                 [256, 70, 5000]           1,285,000
===============================================================================================
Total params: 4,145,032
Trainable params: 4,145,032
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 926.91
===============================================================================================
Input size (MB): 0.15
Forward/backward pass size (MB): 1450.80
Params size (MB): 14.47
Estimated Total Size (MB): 1465.42
===============================================================================================